#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.container_registry.azurerm_container_registry.this will be updated in-place
  ~ resource "azurerm_container_registry" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-container-registry-rg/providers/Microsoft.ContainerRegistry/registries/iopcommonacr"
        name                          = "iopcommonacr"
        tags                          = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (16 unchanged attributes hidden)
    }

  # module.custom_roles.azurerm_role_definition.pagopa_opex_contributor will be created
  + resource "azurerm_role_definition" "pagopa_opex_contributor" {
      + assignable_scopes           = [
          + "/subscriptions//subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b",
        ]
      + description                 = "Role to manage the Opex Dashboards creation, modification and deletion"
      + id                          = (known after apply)
      + name                        = "PagoPA Opex Contributor"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b"

      + permissions {
          + actions     = [
              + "Microsoft.Portal/dashboards/write",
              + "Microsoft.Portal/dashboards/read",
              + "Microsoft.Portal/dashboards/delete",
              + "Microsoft.Portal/dashboards/sharedDashboard/principalAssignments/write",
            ]
          + not_actions = []
        }
    }

  # module.azdoa_weu.module.azdoa_li_infra.azurerm_linux_virtual_machine_scale_set.this will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "this" {
        id                                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/virtualMachineScaleSets/io-p-azdoa-vmss-li-infra"
      ~ instances                                         = 1 -> 0
        name                                              = "io-p-azdoa-vmss-li-infra"
        tags                                              = {
            "__AzureDevOpsElasticPool"          = "io-prod-linux"
            "__AzureDevOpsElasticPoolTimeStamp" = "10/25/2024 3:25:53 PM"
        }
        # (24 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.azdoa_weu.module.azdoa_li_infra.tls_private_key.this_key will be updated in-place
  ~ resource "tls_private_key" "this_key" {
        id                            = "14531208910692e84fa5c5e2c5c127aa067bccf8"
        # (10 unchanged attributes hidden)
    }

  # module.azdoa_weu.module.azdoa_loadtest_li.azurerm_linux_virtual_machine_scale_set.this will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "this" {
        id                                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/virtualMachineScaleSets/io-p-azdoa-vmss-loadtest-li"
        name                                              = "io-p-azdoa-vmss-loadtest-li"
        tags                                              = {
            "__AzureDevOpsElasticPool"          = "io-prod-loadtest-linux"
            "__AzureDevOpsElasticPoolTimeStamp" = "2/3/2024 10:56:53 AM"
        }
        # (25 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.azdoa_weu.module.azdoa_loadtest_li.tls_private_key.this_key will be updated in-place
  ~ resource "tls_private_key" "this_key" {
        id                            = "8feb8c752be6808a3393f79ad8fd66c378e54420"
        # (10 unchanged attributes hidden)
    }

  # module.vpn_weu.module.dns_forwarder.azurerm_container_group.this will be updated in-place
  ~ resource "azurerm_container_group" "this" {
        id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.ContainerInstance/containerGroups/io-p-dns-forwarder"
        name                        = "io-p-dns-forwarder"
        tags                        = {
            "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"   = "Terraform"
            "Environment" = "Prod"
            "Owner"       = "IO"
            "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/vpn/main.tf line 27, in module "vpn":
  27:       aad_audience          = data.azuread_application.vpn_app.application_id

The attribute "application_id" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 14 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
